<!--مسوول عن الاتصال بقاعده البيانات-->
<?php
$servername="localhost"; /*اسم لبسيرفر*//* $=يعني صندوق تخزين متغير*/ 
$database="ebookdb";/*اسم قاعده البيانات*/ 
$username="root";/*اسم المستخدم الافتراضي*/
$password="";
try{ /*اذا نجح الاتصال بقاعده  البيانات*/
    $conn=new PDO("mysql:host=$servername;dbname=$database",$username,$password);/*انشاء اتصال بين الموقع والقاعده*/
    $conn->setAttribute(PDO::ATTR_ERRMODE,PDO::ERRMODE_EXCEPTION);/*اخبار الموقع لوحصل اي خطأ صغير في القاعده اظهره فورا*/
    $conn->exec("set names utf8");
}
catch(PDOException $e){ /*اذا فشل الاتصال يطلع الرساله بدل ما يطلع صفحه بيضاء*/
    echo"فشل الاتصال:" . $e->getMessage();/*ذا فشل الاتصال هذا الكود يجلب سبب  فشل الاتصال ويكتبه لك مثلا كلمه السر غلط
    سبب الفشل مش الفشل نفسه */
}
?>
<!-- pdo=هي الطريقه الحديثه والامنه للتعامل مع قاعدة البياناتو تحمي الموقع من الاختراقات واذا بغير 
 نوع قاعده البيانات يتغير بسهوله بدل ما نغيير كل كل الاكواد
 echo= هي امر الطباعه
 connected successfully=هذي الجمله للمبرمج علشان نعرف انه كل شي يمشي تمام لاتظهر للمستخدم
 $e= هي اختصار لكلمه exception
 وهي رساله الخطا-->
